#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.yc-vpc.data.yandex_client_config.client: Reading...
yandex_container_registry.ai-radio-registry: Refreshing state... [id=crpgelu19jeps49uja03]
yandex_vpc_address.ai-cloud-gateway-ip: Refreshing state... [id=fl8827havhbmoacn2973]
yandex_iam_service_account.ai-radio-base-sa: Refreshing state... [id=aje3erfr19rkbgisidjd]
module.yc-vpc.data.yandex_client_config.client: Read complete after 0s [id=2012865857]
module.yc-vpc.yandex_vpc_network.this[0]: Refreshing state... [id=enp6n786rtgecup2tgmt]
module.yc-vpc.yandex_vpc_gateway.egress_gateway[0]: Refreshing state... [id=enpkq1u8ica5d4ihve6b]
yandex_iam_service_account_static_access_key.ai-radio-static-key: Refreshing state... [id=aje3a7d7qttmuptshntm]
yandex_container_registry_iam_binding.puller: Refreshing state... [id=crpgelu19jeps49uja03/container-registry.images.puller]
yandex_container_repository.ai-radio-caster: Refreshing state... [id=crpbfh6ru6c5n15j4mpe]
yandex_dns_zone.ai-cloud-zone: Refreshing state... [id=dns90rjsk7b1b0ci2r3a]
module.yc-vpc.yandex_vpc_route_table.private[0]: Refreshing state... [id=enp5oeagd3nfhaem9dqk]
module.yc-vpc.yandex_vpc_default_security_group.default_sg[0]: Refreshing state... [id=enpkjg43fvldpevipcco]
module.yc-vpc.yandex_vpc_subnet.private["192.168.15.0/24"]: Refreshing state... [id=e9be7lglfggui9eaudmm]
module.yc-vpc.yandex_vpc_subnet.private["192.168.5.0/24"]: Refreshing state... [id=fl88lf3r6c540ocddn4n]
yandex_dns_recordset.ai-cloud-a-1: Refreshing state... [id=dns90rjsk7b1b0ci2r3a/@/A]
yandex_dns_recordset.ai-cloud-a-2: Refreshing state... [id=dns90rjsk7b1b0ci2r3a/*/A]
yandex_dns_recordset.ai-cloud-txt-1: Refreshing state... [id=dns90rjsk7b1b0ci2r3a/@/TXT]
yandex_dns_recordset.ai-cloud-aname-1: Refreshing state... [id=dns90rjsk7b1b0ci2r3a/www/ANAME]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # yandex_api_gateway.ai-radio-static-gateway will be created
  + resource "yandex_api_gateway" "ai-radio-static-gateway" {
      + created_at        = (known after apply)
      + domain            = (known after apply)
      + execution_timeout = (known after apply)
      + folder_id         = (known after apply)
      + id                = (known after apply)
      + log_group_id      = (known after apply)
      + name              = "ai-radio-static-gateway"
      + spec              = <<-EOT
            openapi: "3.0.0"
            info:
              version: 1.0.0
              title: Movies Website
            x-yc-apigateway:
              variables:
                installation:
                  default: "prod"
                  enum:
                   - "prod"
            
            paths:
              /:
                get:
                  operationId: index
                  x-yc-apigateway-integration:
                    type: object_storage
                    bucket: ${ai-radio-website-bucket-name}
                    object: 'index.html'
              /{file+}:
                get:
                  operationId: website
                  parameters:
                    - name: file
                      in: path
                      required: false
                      schema:
                        type: string
                  x-yc-apigateway-integration:
                    type: object_storage
                    bucket: ${ai-radio-website-bucket-name}
                    object: '{file}'
              /images/{file+}:
                get:
                  operationId: posters
                  parameters:
                    - name: file
                      in: path
                      required: false
                      schema:
                        type: string
                  x-yc-apigateway-integration:
                    type: object_storage
                    bucket: ${ai-radio-images-bucket-name}
                    object: '{file}'
        EOT
      + status            = (known after apply)
      + user_domains      = (known after apply)
    }

  # yandex_resourcemanager_folder_iam_member.ai-radio-base-sa-gw-editor will be created
  + resource "yandex_resourcemanager_folder_iam_member" "ai-radio-base-sa-gw-editor" {
      + folder_id = "b1g2inpl68al98r9ock7"
      + id        = (known after apply)
      + member    = "serviceAccount:aje3erfr19rkbgisidjd"
      + role      = "api-gateway.editor"
    }

  # yandex_resourcemanager_folder_iam_member.ai-radio-base-sa-storage-editor will be created
  + resource "yandex_resourcemanager_folder_iam_member" "ai-radio-base-sa-storage-editor" {
      + folder_id = "b1g2inpl68al98r9ock7"
      + id        = (known after apply)
      + member    = "serviceAccount:aje3erfr19rkbgisidjd"
      + role      = "storage.editor"
    }

  # yandex_storage_bucket.ai-radio-images-bucket will be created
  + resource "yandex_storage_bucket" "ai-radio-images-bucket" {
      + access_key            = "YCAJEsAXj5rDAtTlVHed_7p_A"
      + bucket                = "ai-radio-images"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = (known after apply)
      + force_destroy         = false
      + id                    = (known after apply)
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags (known after apply)

      + versioning (known after apply)
    }

  # yandex_storage_bucket.ai-radio-website-bucket will be created
  + resource "yandex_storage_bucket" "ai-radio-website-bucket" {
      + access_key            = "YCAJEsAXj5rDAtTlVHed_7p_A"
      + bucket                = "ai-radio-website"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = (known after apply)
      + force_destroy         = false
      + id                    = (known after apply)
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags (known after apply)

      + versioning (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @valeter, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Yandex Cloud Integration check`*